cask_args appdir: '/Applications'

# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "dart-lang/dart"
tap "github/bootstrap"
tap "oven-sh/bun"
tap "sass/sass"
tap "teamookla/speedtest"
tap "thoughtbot/formulae"
# End Taps

# Brews
brew "act"
brew "bun"
brew "chruby"
brew "composer"
brew "deno"
brew "docker-compose"
brew "font-monaspace"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "git-secrets"
brew "git"
brew "gmailctl"
brew "gnupg"
brew "go"
brew "go"
brew "hey" # tiny program to send some load to a web app
brew "httpd"
brew "hub"
brew "imagemagick"
brew "mkcert"
brew "mpv"
brew "mysql-client"
brew "node"
brew "openssl"
brew "php", restart_service: true
brew "postgresql"
brew "redis"
brew "ruby-install"
brew "sass/sass/sass"
brew "shellcheck"
brew "tmux"
brew "vim"
brew "vmware-fusion"
brew "watchman"
brew "yarn"
brew "youtube-dl"
brew "zsh"
# End Brews

# Casks
# Tools that you can download via Homebrew but Homebrew doesn’t support them officially
cask "1password/tap/1password-cli"
cask "alfred"
cask "anki"
cask "balenaetcher"
cask "calibre"
cask "colour-contrast-analyser"
cask "docker"
cask "expressions"
cask "font-hack"
cask "freedom"
cask "gimp"
cask "google-drive"
cask "gpg-suite-pinentry"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "kdenlive"
cask "keycastr"
cask "keysmith"
cask "mamp"
cask "masscode"
cask "meetingbar"
cask "monitorcontrol"
cask "obsidian"
cask "send-to-kindle"
cask "setapp"
cask "signal"
cask "spotify"
cask "steam"
cask "textsniper"
cask "todoist"
cask "vanilla"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
# End Casks

#####

## Apps that come pre-installed on GitHub devices (or via self-serve):
# cask "1password
# cask "firefox
# cask "google-chrome
# cask "microsoft-teams
# cask "slack
# cask "zoom"

## no longer supported at GH:
# cask "notion"
# cask "postman"

## Apps that I no longer use, but maybe will revisit in the future:
# brew "circleci"
# brew "switchaudio-osx"
# cask "brave-browser"
# cask "browserosaurus"
# cask "dropbox-capture"
# cask "switchhosts"
# cask "vivaldi"
# cask "xbar"

## Other:
# brew "nvm" => install using zsh-nvm plugin
