cask_args appdir: '/Applications'

# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "sass/sass"
tap "dart-lang/dart"
tap "thoughtbot/formulae"
tap "teamookla/speedtest"
# End Taps

# Brews
brew "openssl"
brew "circleci"
brew "composer"
brew "docker-compose"
brew "fzf"
brew "git"
brew "git-secrets"
brew "gnupg"
brew "httpd"
brew "go"
brew "gmailctl"
brew "hub"
brew "imagemagick"
brew "mkcert"
brew "mpv"
brew "mysql-client"
brew "node"
brew "php", restart_service: true
brew "postgresql"
brew "redis"
brew "shellcheck"
brew "tmux"
brew "vim"
brew "watchman"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
brew "sass/sass/sass"
brew "gcc"
# brew "nvm" => install using zsh-nvm plugin
brew "youtube-dl"
brew "switchaudio-osx"
brew "rbenv"
brew "ruby-build"
brew "git-lfs"
# End Brew

# Casks
# Tools that you can download via Homebrew but Homebrew doesn’t support them officially
cask "switchhosts"
cask "karabiner-elements"
cask "visual-studio-code"
cask "1password"
cask "setapp"
cask "alfred"
cask "slack"
cask "zoom"
cask "font-hack"
cask "spotify"
cask "iterm2"
cask "google-chrome"
cask "firefox"
cask "docker"
cask "freedom"
cask "notion"
cask "fig"
cask "xbar"
cask "dropbox-capture"
cask "brave-browser"
cask "gpg-suite-pinentry"
cask "homebrew/cask-drivers/logitech-options"
cask "imageoptim"
cask "monitorcontrol"
cask "obsidian"
# End Casks

# Github actions cannot install these.
unless ENV.has_key?('CI') then
    brew "mas"
		# App Store
		mas "InYourFace", id: 1476964367
		mas "Xcode", id: 497799835
		mas "Magnet", id: 441258766
		mas "CopyClip", id: 595191960
		mas "Red Lines Tools", id: 1469400117
end